; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	image0 - mode
	image1 - mode
	infrared5 - mode
	infrared3 - mode
	thermograph4 - mode
	infrared2 - mode
	Star1 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	Star3 - direction
	Star6 - direction
	GroundStation2 - direction
	Star0 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Planet12 - direction
	Star13 - direction
	Phenomenon14 - direction
	Star15 - direction
)
(:init
	(supports instrument0 infrared5)
	(supports instrument0 thermograph4)
	(supports instrument0 image0)
	(calibration_target instrument0 Star3)
	(supports instrument1 thermograph4)
	(supports instrument1 image1)
	(calibration_target instrument1 Star6)
	(supports instrument2 thermograph4)
	(supports instrument2 infrared5)
	(supports instrument2 infrared3)
	(supports instrument2 infrared2)
	(calibration_target instrument2 Star0)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
)
(:goal (and
	(have_image Phenomenon7 infrared2)
	(have_image Phenomenon8 image1)
	(have_image Phenomenon8 infrared5)
	(have_image Phenomenon9 image1)
	(have_image Phenomenon9 infrared5)
	(have_image Phenomenon10 image0)
	(have_image Planet11 image1)
	(have_image Planet11 thermograph4)
	(have_image Planet12 infrared3)
	(have_image Planet12 thermograph4)
	(have_image Star13 image1)
	(have_image Star13 infrared5)
	(have_image Phenomenon14 infrared2)
	(have_image Phenomenon14 image1)
	(have_image Star15 thermograph4)
	(have_image Star15 image0)
))

)

; plan
1. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 16
2. (calibrate satellite0 instrument2 star0)
   added: (calibrated instrument2)
   goals met: 0 of 16
3. (turn_to satellite0 planet12 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet12)
   goals met: 0 of 16
4. (take_image satellite0 planet12 instrument2 thermograph4)
   added: (have_image planet12 thermograph4)
   goals met: 1 of 16
5. (take_image satellite0 planet12 instrument2 infrared3)
   added: (have_image planet12 infrared3)
   goals met: 2 of 16
6. (turn_to satellite0 phenomenon8 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 phenomenon8)
   goals met: 2 of 16
7. (take_image satellite0 phenomenon8 instrument2 infrared5)
   added: (have_image phenomenon8 infrared5)
   goals met: 3 of 16
8. (turn_to satellite0 phenomenon7 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon7)
   goals met: 3 of 16
9. (take_image satellite0 phenomenon7 instrument2 infrared2)
   added: (have_image phenomenon7 infrared2)
   goals met: 4 of 16
10. (turn_to satellite0 phenomenon14 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 phenomenon14)
   goals met: 4 of 16
11. (take_image satellite0 phenomenon14 instrument2 infrared2)
   added: (have_image phenomenon14 infrared2)
   goals met: 5 of 16
12. (turn_to satellite0 star3 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 star3)
   goals met: 5 of 16
13. (switch_off instrument2 satellite0)
   deleted: (power_on instrument2)
   added: (power_avail satellite0)
   goals met: 5 of 16
14. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 5 of 16
15. (calibrate satellite0 instrument0 star3)
   added: (calibrated instrument0)
   goals met: 5 of 16
16. (turn_to satellite0 phenomenon10 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon10)
   goals met: 5 of 16
17. (take_image satellite0 phenomenon10 instrument0 image0)
   added: (have_image phenomenon10 image0)
   goals met: 6 of 16
18. (turn_to satellite0 phenomenon9 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon9)
   goals met: 6 of 16
19. (take_image satellite0 phenomenon9 instrument0 infrared5)
   added: (have_image phenomenon9 infrared5)
   goals met: 7 of 16
20. (turn_to satellite0 star13 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 star13)
   goals met: 7 of 16
21. (take_image satellite0 star13 instrument0 infrared5)
   added: (have_image star13 infrared5)
   goals met: 8 of 16
22. (turn_to satellite0 star15 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star15)
   goals met: 8 of 16
23. (take_image satellite0 star15 instrument0 image0)
   added: (have_image star15 image0)
   goals met: 9 of 16
24. (take_image satellite0 star15 instrument0 thermograph4)
   added: (have_image star15 thermograph4)
   goals met: 10 of 16
25. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 10 of 16
26. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 10 of 16
27. (turn_to satellite0 star6 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star6)
   goals met: 10 of 16
28. (calibrate satellite0 instrument1 star6)
   added: (calibrated instrument1)
   goals met: 10 of 16
29. (turn_to satellite0 phenomenon14 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 phenomenon14)
   goals met: 10 of 16
30. (take_image satellite0 phenomenon14 instrument1 image1)
   added: (have_image phenomenon14 image1)
   goals met: 11 of 16
31. (turn_to satellite0 phenomenon8 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 phenomenon8)
   goals met: 11 of 16
32. (take_image satellite0 phenomenon8 instrument1 image1)
   added: (have_image phenomenon8 image1)
   goals met: 12 of 16
33. (turn_to satellite0 phenomenon9 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon9)
   goals met: 12 of 16
34. (take_image satellite0 phenomenon9 instrument1 image1)
   added: (have_image phenomenon9 image1)
   goals met: 13 of 16
35. (turn_to satellite0 planet11 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet11)
   goals met: 13 of 16
36. (take_image satellite0 planet11 instrument1 image1)
   added: (have_image planet11 image1)
   goals met: 14 of 16
37. (take_image satellite0 planet11 instrument1 thermograph4)
   added: (have_image planet11 thermograph4)
   goals met: 15 of 16
38. (turn_to satellite0 star13 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 star13)
   goals met: 15 of 16
39. (take_image satellite0 star13 instrument1 image1)
   added: (have_image star13 image1)
   goals met: 16 of 16
